//: [Previous](@previous)

import Foundation

// MARK: Problems

/*
 MARK: Race condition
 колізії, коли декілька потоків намагаються працювати з однаковими data одночасно. Залежність від чергування.
 
 MARK:  Resource contention
 коли декілька потоків виконують різни завдання та намагаються отримати один ресурс, тим самим збільшують час для безпечного отримання ресурсу.
 
 MARK: Deadlock
 це коли декілька потоків блокують один одного.
 
 MARK: Starvation
 коли потік не може отримати дозвіл до ресурсу та безуспішно намагаеться зробити це знов і знов.
 
 MARK: Priority inversion
 потік з низким пріорітетом утримує ресурс який потребуе іншій потік з більш високим пріорітетом.
 
 MARK: Non-determenistic and fairness
 ми не можемо уявити коли та в якому порядку потік зможе отримати ресурс. Ця затримка залежить від кількості конфліктів. Проте прімитиви сінхронізації зможуть гарантувати дозвіл всім потокам яки очікуют. 
 */

//: [Next](@next)
