//: [Previous](@previous)

import Foundation

// Problems

/*
 Race condition - колізії, коли декілька потоків намагаються працювати з однаковими data одночасно. Залежність від чергування.
 
 Resource contention - коли декілька потоків виконують різни завдання та намагаються отримати один ресурс, тим самим збільшують час для безпечного отримання ресурсу.
 
 Deadlock - це коли декілька потоків блокують один одного.
 
 Starvation - коли потік не може отримати дозвіл до ресурсу та безуспішно намагаеться зробити це знов і знов.
 
 Priority inversion - потік з низким пріорітетом утримує ресурс який потребуе іншій потік з більш високим пріорітетом.
 
 Non-determenistic and fairness - ми не можемо уявити коли та в якому порядку потік зможе отримати ресурс. Ця затримка залежить від кількості конфліктів. Проте прімитиви сінхронізації зможуть гарантувати дозвіл всім потокам яки очікуют. 
 */

//: [Next](@next)
